[
    {
        "Number": 1,
        "Name": "Atlas Mountains and 3 Valleys & Waterfalls - Camel ride Marrakech",
        "Price": "from $33",
        "Category": "Bus Tours",
        "Description": "Exploring Morocco’s Atlas Mountains without a guide may mean missing out on Berber culture and scenic viewpoints. Yet, many group tours follow rigid itineraries that don’t allow for spontaneity during the day. This private tour delivers on all counts—with a local guide to arrange logistics and enable interaction with Berber villagers, and the flexibility to personalize your itinerary. Optional camel ride, and Berber home visit are all included.",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 2,
        "Name": "Hot Air Balloon Flight over Marrakech with Traditional Breakfast",
        "Price": "from $189",
        "Category": "Adventure Tours",
        "Description": "“Join us for a lifetime experience in Marrakech”\n\nWe invite you into the world of hot air balloons, a great and unique experience to observe the world from a bird’s eyes view.\n\nOur balloons fleet is new, safe and comfortable.\n\nOur pilots are very experienced with thousands hours of flight all around the world.\n\nOur company is licensed and operates under the rules and regulations of the Moroccan Civil Aviation Authority. We carry a full passenger and third party liability insurance.",
        "Recommendation": "Recommended by 98% of travelers"
    },
    {
        "Number": 3,
        "Name": "Agafay Desert Package, Quad Bike, Camel Ride and Dinner Show",
        "Price": "from $58",
        "Category": "Bus Tours",
        "Description": "On an action-packed day trip from Marrakesh, enjoy camel riding and quad biking in the Agafay desert. Enjoy views of the desert and Berber hospitality with a traditional meal. Take advantage of the hotel pickup service and head to the base camp for a meeting with your entire crew. Your tour's itinerary will be explained to you by your crew leader. Then, meet your guide and don a nomadic outfit before embarking on a scenic camel ride across the desert. Ride your camel across the desert. Then, hop on a quad bike and find a vantage point to take in the Agafay Desert's unique beauty at sunset. Relax and take in the scenery, as well as the genuine Moroccan hospitality. Finish your day by sitting under a Berber tent and gazing at the stars. as a delicious traditional meal is served.",
        "Recommendation": "Recommended by 99% of travelers"
    },
    {
        "Number": 4,
        "Name": "Day Trip To Casablanca from Marrakech",
        "Price": "from $31",
        "Category": "Full-day Tours",
        "Description": "This tour will show you the city of Casablanca which is the largest city in the Maghreb region and the eighth-largest in the Arab world. Casablanca has Morocco's chief port and one of the largest financial centres in Africa.",
        "Recommendation": "Recommended by 92% of travelers"
    },
    {
        "Number": 5,
        "Name": "Agafay Desert: day pass including pool, lunch, quad & Camel ride",
        "Price": "from $49",
        "Category": "Full-day Tours",
        "Description": "We will pick you up from your hotel in Marrakech to start our desert excursion from 9:30 a.m.\n\nOnce arrived, and after marveling at the breathtaking landscapes, we will enjoy the heavenly swimming pool.\n\nLunch time has arrived, we invite you to join the camp restaurant for a unique culinary experience, a traditional Moroccan meal is served, composed of: Moroccan salads, the essential lemon chicken tagine and we end this taste journey with a Moroccan dessert\n\nLater we live a unique experience by riding a camel and quad bike through the desert dunes (if option with activities chosen).\n\nWe continue our day at the swimming pool overlooking splendid views and admiring the beauty of the Atlas Mountains\n\nAfter 7 hours of wonder, our excursion comes to an end, we will meet you in Marrakech around 5:30 p.m.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 6,
        "Name": "Agadir Taghazout: Paradise Valley & Atlas Mountains Swimming Trip",
        "Price": "from $18",
        "Category": "4WD Tours",
        "Description": "You will be picked up from your hotel and at 8:30 AM head north of Agadir to Paradice Valley. Enjoy an adventure through Paradise Valley, and make your way from the city to the countryside to see the real nature and breath the clean oxygen.",
        "Recommendation": "Recommended by 92% of travelers"
    },
    {
        "Number": 7,
        "Name": "Dinner Show in Agafay Desert with Quad Bike & Camels",
        "Price": "from $53",
        "Category": "4WD Tours",
        "Description": "Spend the afternoon and evening in the desert of marrakech on a guided safari with round trip transportation and a local diner cross th le desert on a quad and watch the sunset on back of camel",
        "Recommendation": "Recommended by 96% of travelers"
    },
    {
        "Number": 8,
        "Name": "Marrakech: Atlas Mountains, Berber Villages, Agafay & Camel Ride",
        "Price": "from $24",
        "Category": "4WD Tours",
        "Description": "Set out from Marrakesh into the Atlas Mountains, passing hamlets, villages, and farmers' fields. Visit and share a meal with a Berber family, admire Takerkoust Lake, and relax in the tranquillity of the Agafay Desert as the sun sets.",
        "Recommendation": "Recommended by 99% of travelers"
    },
    {
        "Number": 9,
        "Name": "Private Day Trip from Tangier to Tetouan",
        "Price": "from $59",
        "Category": "Historical Tours",
        "Description": "Visit the history-steeped town of Tetouan near Morocco's Mediterranean coast on this private day trip from Tangier. With a private guide, soak up the Moroccan-Spanish flavor of this mountainside town, and hear about its Andalucian-influenced past and culture. Explore the UNESCO-listed 'medina' (old quarter), considered one of Morocco's best-preserved, admire the whitewashed residences and colonial-era architecture of the new town, and enjoy free time to explore, eat, and souvenir-hunt in the souks and shops.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 10,
        "Name": "Ouarzazate One Day Trip from Marrakech",
        "Price": "from $29",
        "Category": "Historical Tours",
        "Description": "Join us on this wonderful day and explore Moroccan history and it`s amazing natural landscapes on a day trip to Ouarzazate. Admire beautiful views of natural landscapes while you explore typical villages of the Kasbahs region.\nIn one day trip, enjoy a beautiful moment with a professional driver who will make you see the history of the Moroccan desert door. Ouarzazate is one of the famous destinations that the tourist admires with a beautiful and historical sights.",
        "Recommendation": "Recommended by 94% of travelers"
    },
    {
        "Number": 11,
        "Name": "Essaouira Day Trip from Marrakech",
        "Price": "from $17",
        "Category": "Full-day Tours",
        "Description": "Lead it to a completely different place to explore a lovely day out to Essaouira from Marrakech. A wonderful small city near to Marrakech where all the customers consider it as a good attraction to have a free and calm walk inside its alleys and admire the beauty of the ocean. \n\nEssaouira surprises you with its straight streets, designed by French. After visiting the port with its bronze cannons, take a stroll through the medina and souks to explore the woodworking shops dedicated to cedar sculpture.\n\nThe Essaouira excursion from Marrakech involves a drive of around 2 hours 40 minutes from Marrakech to this delightful old coastal town. There is a lot to see and do along the way. Only one person is required per tour and departures are guaranteed daily.",
        "Recommendation": "Recommended by 96% of travelers"
    },
    {
        "Number": 12,
        "Name": "Full Day trip to Chefchaouen & the panoramic of tangier",
        "Price": "from $70",
        "Category": "Bus Tours",
        "Description": "High up in the Rif mountains, Chefchaouen is a beautiful blue door and white-walled Medina that was originally a \"Berber\" military outpost.\n\nIn this tour discover the highlight of Chefchaouen and explore the most hidden gems in this beautiful blue painted medina.\n\nGet introduced to the local culture, History and lifestyle with our local guide\n\nBack to Tangier by the end of the day",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 13,
        "Name": "4 Hour Private Tour of Tangier",
        "Price": "from $78",
        "Category": "Bus Tours",
        "Description": "The main purpose of our journey is to show our travelers all the unique sites of the city. The overview may contain a lively description of the Moroccan lifestyle, local markets, the costumes of the locals, and other ideological clarification about Moroccan civilization.\n\nWe will show you all the beautiful and historical places in the city, the old Medina, the Kasbah, Hercules caves, Cap Spartel, and more.\n\nEnjoy this private tour of Tangier with Mohamed Ali, your private driver and official tour guide. Tangier has been Europe's gateway to Africa for many years, and it has been the home of many different cultures throughout its whole history.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 14,
        "Name": "Full-Day Safari Small Desert With Lunch",
        "Price": "from $37",
        "Category": "4WD Tours",
        "Description": "Your adventure will start with pickup from your hotel in Agadir. Head to Sidi R'bat, 1 hour and 20 minutes south of Agadir, to discover unpopulated beaches and sandbanks. Stop at the fisherman's village on the wild beach of Sidi R'bat, where you will have a chance to see the fishermen's caves, hewn in the cliffs.\n\nThen, drive on a sandy track while looking out onto the Atlantic Ocean. You will then have a quick stop at the Oued Massa, a 120 km long coastal river by the Souss-Massa Nationalpark.\n\nHere, if you are lucky, you will spot migrating birds, mainly the Northern bald ibis. You will also catch a quick glimpse of the beautiful Dam Youssef bin Tachfine.\n\nAfter, walk around the old walled medina town and browse. Then drive towards the Atlas mountains to enjoy a traditional lunch (tajine, couscous, and seasonal fruits), with the possibility of vegetarian food as well, in a local Berber's house. \n\nAfter lunch, you can roam freely in the small Sahara dunes to take photos.",
        "Recommendation": "Recommended by 91% of travelers"
    },
    {
        "Number": 15,
        "Name": "Morocco:Tangier Private Tour from Malaga Province or Tarifa",
        "Price": "from $254",
        "Category": "Full-day Tours",
        "Description": "Experience an unforgettable day in Tangier, Morocco, led by an expert guide. Board the ferry . Take in the panoramic views of colonial and international Tangier, the Sultan's Palace, and the famed Hercules Caves (entrance ticket included). Stop at Cap Spartel, where the Atlantic Ocean and Mediterranean Sea converge, and snap photos on an Atlantic dune, with an optional camel ride. Return to the old town to explore the charming small souk in the Medina, where you'll discover dried fruit, vegetable, and spice markets, as well as the jewelers' street, where you'll learn about Moroccan culture. Finally, wander through the Medina and the Kasbah, where you'll be in awe of the stunning architecture. If you choose the option to depart from Malaga, we offer pick-up from all along the Costa del Sol, including Marbella, Estepona, Benalmadena, Malaga Centre, Torremolinos, Nerja, and more.",
        "Recommendation": "Recommended by 96% of travelers"
    },
    {
        "Number": 16,
        "Name": "Casablanca Guided Private Tour Including Mosque Entrance",
        "Price": "from $80",
        "Category": "Historical Tours",
        "Description": "Personalized half-day excursion to discover Casablanca's main attractions with a driver by car or minibus, including entrance fees to the Hassan II Mosque, with pick-up from the port or a centrally located hotel -city.",
        "Recommendation": "Recommended by 93% of travelers"
    },
    {
        "Number": 17,
        "Name": "Agafay Desert : Quad or Camel with Lunch & Pool or Dinner & Show",
        "Price": "from $96",
        "Category": "4WD Tours",
        "Description": "Discover the magic of Agafay desert with us! Immerse yourself in authentic cultural experiences, breathtaking landscapes, and unforgettable adventures. Book now for an extraordinary journey. Don't miss out—reserve your adventure today!",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 18,
        "Name": "From Tangier: Special Day Trip to Chefchaouen and Tetouan",
        "Price": "from $86",
        "Category": "Full-day Tours",
        "Description": "Starting from Tangier. This tour is taking you to the jewel of the Rif mountains-Chefchaouen- .\nDiscover the highlight of the blue pearl, explore the tiny blue streets, the colorful stairs and more in this one of a kind experience. In the return to Tangier; a small stop in Tetouan to discover the old city with a local guide",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 19,
        "Name": "Small-Group Day Tour to Chefchaouen from Fez",
        "Price": "from $25",
        "Category": "Historical Tours",
        "Description": "Visit the beautiful and unique village of Chefchaouen from Fez on a small-group tour that gives you free time to explore the blue-tinged architecture, historic center, and atmospheric cafés of the Rif Mountain community. This tour includes transportation in the comfort of a climate-controlled vehicle, with convenient pickup and drop-off at hotels in Fez.",
        "Recommendation": "Recommended by 90% of travelers"
    },
    {
        "Number": 20,
        "Name": "Ourika Valley Day Trip From Marrakech",
        "Price": "from $19",
        "Category": "Full-day Tours",
        "Description": "Quality service—including transportation insurance and a professional driver—are ensured on this day trip to the Ourika Valley. Despite its proximity to Marrakech, this beautiful location is considered relatively unspoiled. Visit a Berber village and experience the charm of traditional hospitality. Other highlights include a walk to the waterfalls of Setti Fatma.",
        "Recommendation": "Recommended by 96% of travelers"
    },
    {
        "Number": 21,
        "Name": "Marrakech Day Trip From Agadir",
        "Price": "from $42",
        "Category": "Historical Tours",
        "Description": "It’s at least a 7-hour round trip from Agadir to Marrakech by public bus. Relax and soak up the scenery on this small-group day out that includes a guided city highlights tour and free time for shopping and/or lunch. See vibrant Jemaa el-Fnaa square, tour the medina, and take in sights such as the Koutoubia Mosque and Palacio da Bahia. Tour includes hotel transfers but excludes entrance fees.",
        "Recommendation": "Recommended by 95% of travelers"
    },
    {
        "Number": 22,
        "Name": "Paradise Valley And Taghazout Private Day Trip",
        "Price": "from $65",
        "Category": "4WD Tours",
        "Description": "Driving north to the banana village then take the road of honey and the Hight Atlas Mountains. Stopping for a light refreshment by river beds . Surrounded by the gorges fabulous rock formations – a natural botanical garden . Enjoy the spectacular panoramic views of Paradise valley, à nice visit to the Taghazout village then go back to Agadir .",
        "Recommendation": "Recommended by 96% of travelers"
    },
    {
        "Number": 23,
        "Name": "Full Day Tour The Blue City , CHEFCHAOUEN on small-group",
        "Price": "from $28",
        "Category": "4WD Tours",
        "Description": "Our agents have been recognized as among the most talented in the travel industry, and excel in creating one-of-a-kind vacations and destination events that offer truly breathtaking experiences at an affordable cost. we have a large experience in this domain , we have more than 5 years of experience, we did more than 100 private and groups trips organization in Morocco,and we have visited a lot of cities like Tanja, Chechaouen, Fes , Middel atlas,Rabat,Casablanca,Merzouga,Saouira,Sahara dessert \"Dakhla\" ,Marrakech and agadir... we’ve had the pleasure to work with many businesses, groups, and individuals over the years. Our dedication to creating outstanding travel experiences has allowed us to build quite the fan base, and much of our business comes from repeat customers and referrals from those who have had successful trips with us in the past.",
        "Recommendation": "Recommended by 96% of travelers"
    },
    {
        "Number": 24,
        "Name": "Atlas Mountains, 3 Valleys & Agafay Desert from Marrakech-DayTour",
        "Price": "from $22",
        "Category": "Adventure Tours",
        "Description": "Explore the Berber villages of the Atlas Mountains on a full-day trip to the Imlil Valley, Ait Souka, Azroul waterfalls, and Taourirt. Visiting Berber homes to eat lunch and drink tea gives this day a more personal feel than traditional tours, with time to ride a camel, hike, and ride a mule to a Berber community high in the mountains.",
        "Recommendation": "Recommended by 95% of travelers"
    },
    {
        "Number": 25,
        "Name": "Private day trip to Rabat from Casablanca",
        "Price": "from $85",
        "Category": "Historical Tours",
        "Description": "Discover the city of Rabat in one day with this private tour accompanied by a driver/guide. Highlights include stops at the Mausoleum of Mohammed V in Rabat, the Hassan Tower and the Kasbah des Oudaias, the Chellah Forest, the Royal Palace, and the Corniche",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 26,
        "Name": "CLASSIC FLIGH : Hot Air Balloon Marrakech",
        "Price": "from $180",
        "Category": "Adventure Tours",
        "Description": "-Best Price Guarantee \n-Enjoy with us your initiation, your flight in hot air balloon, with an unforgettable view over the Berber villages\n\n4x4 roundtrip transportation\n\nMoroccan welcome tea and coffee\n\nFlight between 40 and 60 minutes with free wi-fi on board\n\nBerber breakfast under caïdale tent\n\nAir shop access\n\nDelivery of a flight certificate with your name in arabic",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 27,
        "Name": "Private Full Day Trip from Marrakech To Essaouira Mogador",
        "Price": "from $23",
        "Category": "Historical Tours",
        "Description": "Our Marrakech To Essaouira Tour Started With pick you up at 8 am to begin your day journey to Essaouira from Marrakech. Essaouira is a medieval city famous for its annual Gnaoua music festival and a UNESCO World Heritage site. There are many sights to see in Essaouira on your day trip from Marrakech, including the beach, the harbor, the ramparts, the Jewish quarter, La Skala, Place Moulay El Hassan, the port, the ramparts, and the pleasant weather that comes from being near the ocean. You can also take a stroll through its amusing narrow streets and explore the historic French and Portuguese architecture. At around 04h30PM, we do the pickup in Essaouira, return to Marrakech, and end our Marrakech To Essaouira Tour.\n\nWith Marrakech To Essaouira Tour Take A Visit to the Medina, the coast, and a cooperative of Berber women who produce argan oil by taking a day trip from Marrakech to the Moroccan city of Essaouira, which \"was recognized as a UNESCO World Heritage Site in Morocco in 2001.\"",
        "Recommendation": "Recommended by 99% of travelers"
    },
    {
        "Number": 28,
        "Name": "Agadir: Paradise Valley Guided Tour with Berber Breakfast & Lunch",
        "Price": "from $17",
        "Category": "Bus Tours",
        "Description": "Enjoy your holiday in Agadir Morrocco\n\nMake your way from the city to the countryside to see the tiny streams, mountain gorges, and flowing waterfalls in the beautiful surrounding villages. Once you arrive to Paradise Valley, you will have a hike of 20 minutes before settling down for a beautiful time at the natural pools, perfect for swimming and chilling. After the refreshment break, the group will drive back to Agadir with a return at 2:00 pm to the hotel.",
        "Recommendation": "Recommended by 96% of travelers"
    },
    {
        "Number": 29,
        "Name": "Atlantic Sahara and Ocean 4x4 Jeep Tour with Berber Lunch",
        "Price": "from $41",
        "Category": "4WD Tours",
        "Description": "Discover hidden gems and unique vibes of Souss Massa region in this small group tour. Meet your driver - guide and start with most beautiful and historic sites in a climate-controlled jeep. Stop at the fisherman village on the wild beach of Sidi R'bat to and see the fishermen's caves and white ocean waves.\n\nAfterwards drive into a rally way on sand dunes on the panoramic side of the Atlantic ocean. Stop at the park National of birds.\n\nDrive towards the atlas mountains, to enjoy a lunch in a local Berber house. After lunch, enjoy free time in small Sahara dunes to take photos and enjoy sand dunes. Last stop at Youssef Ben Tachafine water dam.\n\nGet to know city’s history, culture, description of the Moroccan life style, costumes of native people and local markets. This is unforgettable tour that will take you to the best of Morocco.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 30,
        "Name": "Private Marrakech Day Trip from Casablanca with Free Camel Ride",
        "Price": "from $107",
        "Category": "4WD Tours",
        "Description": "Between tradition and modernity, Marrakech promises unforgettable sensations. The red city provides a total change of scenery as you stroll through the Jemaa El-Fna plaza and the souks with their glittering colors and exotic scents. Gueliz and Hivernage districts have the most contemporary infrastructures, luxury shops and foreign ready-to-wear stores, and wide avenues.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 31,
        "Name": "Fez Guided Tour with lunch from Casablanca",
        "Price": "from $147",
        "Category": "Historical Tours",
        "Description": "Visit FEZ while you’re in Casablanca, and discover the historic sights and glittering ancient and modern landmarks of Fes City.Take a step back to the Middle Ages in the city, engage your imagination, soak up the extravagant sights and  the hidden delights.\n\nFeast your senses on the sights and sounds that the intellectual and artistic Moroccan metropolis has to offer. Winding alleys that can hardly be unraveled, movement, noise, shouting, smell of tanned leather, delicate aroma of oriental perfumes, barbecues, sweet pastry - all this is the imperial city of Fez. Visit the old medieval Medina with its narrow streets: the Bouanania and the Attarine medersas, the Nejjarine fountain. see the world’s oldest continuously functioning university.",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 32,
        "Name": "Marrakesh day trip with camel ride from Casablanca",
        "Price": "from $213",
        "Category": "Adventure Tours",
        "Description": "This private tour from Marrakesh allowed to discor the beauty of the red city Marrakesh and its hidden and secret streets knowen only by local, And you can enjoy a unique expreience in Agafay deseert by riding a camel and tasting the nomadic life.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 33,
        "Name": "Full-day Historical Meknes Volubilis and Moulay Idriss Tour",
        "Price": "from $33",
        "Category": "Bus Tours",
        "Description": "Explore an amazing full-day Trip from Fez to Meknes Volubilis and Moulay Idriss to enjoy a historical journey through the Imperial city, Holy town and spectacular mosaics at the Roman with an experienced Driver for the best memorable experience",
        "Recommendation": "Recommended by 91% of travelers"
    },
    {
        "Number": 34,
        "Name": "Paradise Valley and Atlas Mountains Swim Adventure in Agadir",
        "Price": "from $22",
        "Category": "4WD Tours",
        "Description": "Take a day trip to Paradise Valley's natural lakes from Agadir or taghazout and explore the honey road of Immouzar and the beautiful nature of Atlas mountains.\n\n Paradise Valley is a oasis with fresh natural pools surrounded by palm trees and breathtaking mountains, perfect for relaxing, sunbathing and cliff jumping...\n\n Take an adventure through Paradise Valley, and make your way from the city to the countryside to see the tiny streams, mountain gorges, and flowing waterfalls in the picturesque villages.\n\n Once we arrive to Paradise Valley, we will have a hike of 15 minutes before settling down for a beautiful time at the natural pools, perfect for swimming and chilling...\n\n After the refreshment break, we are going to drive back to your hotel in Agadir or in Taghazout.\n\n Paradise valley trip from Agadir is definitely a must trip while visiting Agadir",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 35,
        "Name": "Agafay Desert - Quad Camel and Dinner show",
        "Price": "from $98",
        "Category": "4WD Tours",
        "Description": "Go on a safari and spend an unforgettable afternoon and evening in the desert of Marrakech!\n\nCross the desert on a quad and watch the sunset on the back of a camel. Get a henna tattoo and try aromatic hookah. Admire the belly dancers and enjoy a delicious Moroccan dinner.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 36,
        "Name": "Hot air balloon flight in the desert with camel ride",
        "Price": "from $191",
        "Category": "4WD Tours",
        "Description": "Atlas Montgolfière invites you to board these hot air balloons for an unforgettable experience. The company is family-run and has been offering first-time hot air balloon flights in Marrakech for 8 years with incomparable value for money.\n\nThe hot air balloon flight plus camel ride formula is one of the new things for us.\n\nYou will be received in a typically Berber setting in a kasbah coming directly from the south of Morocco, our hot air balloon fleet is new with special Moroccan flag balloons, breakfast is prepared the same morning by Berbers.\n\nAnd at the end after a magical moment with us you will have your flight certificate and head to the palm grove for a camel ride",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 37,
        "Name": "Marrakech Day Trip including Lunch, Camel Ride from Casablanca",
        "Price": "from $107",
        "Category": "Bus Tours",
        "Description": "Visit Marrakech while you're in Casablanca, and discover the historic sights and glittering ancient landmarks, explore the main hidden wonders among the winding alleys of Marrakech’s Medina. Perceive Bahia Palace, Koutoubia Mosque and Djemâa El Fna square UNESCO World Heritage Site, and enjoy seeing the craftsmen working before exploring the souks. Discover one of the famous Morocco's imperial city and immerse yourself in the thriving culture and impressive history of Marrakech. providing a typical Moroccan lunch and Free Camel Ride Experience. \n\n Start this wonderful day-trip with long-lasting memories!",
        "Recommendation": "Recommended by 95% of travelers"
    },
    {
        "Number": 38,
        "Name": "3 Activities in 1 day :Camel riding+ Jet ski+Quad/ATV",
        "Price": "from $142",
        "Category": "Adventure Tours",
        "Description": "If you are not going to stay longer and you want to save more time ,this trip its to profit of 3 Activities in one day .Strong sensations guaranted.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 39,
        "Name": "Middle Atlas Mountains, Cedar Forest and Azrou Day Trip from Fez",
        "Price": "from $31",
        "Category": "Adventure Tours",
        "Description": "It's an opportunity to see the Mountains, lakes, cedarz forest ,Monkeys and Berber villages in addition to People Leaves in the Caves .",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 40,
        "Name": "Ait ben haddou and Ouarzazate day trip",
        "Price": "from $38",
        "Category": "Historical Tours",
        "Description": "This ait ben haddou and ouarzazate day trip, will allow you to discover another face of beauty of Morocco, as this area is considered as the gate to the desert of Morocco and the 1001 Kasbahs (berber fortress).\n\nDuring this ait ben haddou excursion trip you'll cross the tizi n'tichka pass, known for its curvy and sneaky turns, where you'll have a quick stop in a terrace to enjoy a cup of coffe or tea and take some good shots from above, of the berber villages and the amazing landscapes, snowy in winter and spring and full of greenery in summer and autumn.\n\nOnce at the Kasbah ait Ben Haddou you can hire a guide with the whole group to discover the area and to learn better about the locals lifestyle, the guide also will show you where the game of thrones scenes has been turned, before going to Ouarzazate and discover its beauty, as you can discover the local studios and also its Kasbah called Kasbah Taourirt.\n\nOnce you finish the visit, you'll hit the road to Marrakech where the trip ends",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 41,
        "Name": "Marrakech: Ourika Valley, Atlas Mountain, Waterfall, Guide &Lunch",
        "Price": "from $34",
        "Category": "Full-day Tours",
        "Description": "Discover Ourika Valley on an epic journey only 60km from Marrakech. Witness Berber Villages, Argan Oil co­operatives, waterfalls, lush nature, scenic hikes, and stunning views all in one day.\n\nEmbark on a mesmerizing journey through Morocco's Ourika Valley and Atlas Mountains. In just a one-hour drive from Marrakech, you'll be immersed in the beauty of nature and cultural wonders.\n\n Visit a women's cooperative to learn about argan oil production. Explore the enchanting waterfalls of Setti Fadma and indulge in a riverside lunch. Discover the traditions of the Berber people in a traditional house. \n\nThis 7-hour tour offers a perfect blend of adventure, nature, and cultural immersion. \n\nBook now and create unforgettable memories in the heart of Morocco's majestic mountains.",
        "Recommendation": "Recommended by 99% of travelers"
    },
    {
        "Number": 42,
        "Name": "From Tangier : Day trip to Chefchaouen and Akchour the waterfalls",
        "Price": "from $92",
        "Category": "Adventure Tours",
        "Description": "Water;vegetation, impressive geological forms, bathing spots, amazing giological formes, seasonal varied flora, akchour offers unforgettable moments of restand relaxation.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 43,
        "Name": "Atlas Mountains and 4 Valleys & Waterfalls: Guided Day Trip From Marrakech",
        "Price": "from $16",
        "Category": "4WD Tours",
        "Description": "• Admire the stunning views of the Atlas Mountains and 4 Valleys with Waterfalls\n • Discover an authentic village near the city of Marrakech and enjoy a good Berber breakfast. \n • Enjoy a camel ride at the foot of the village of Moulay Ibrahim before joining the Imlil valley. \n • Hike to waterfalls and take in stunning mountain landscapes. \n • Benefit from a local herbal tea break in a terrace overlooking the beautiful village of Imlil. \n • Go on a hike to and enjoy a good lunch cooked over a wood fire. \n • Discover the traditional lifestyle of a Berber family living in the village of Ait Souka. \n • Admire the beautiful views of the snow-capped peaks of the nearby mountains of Ourika village. \n • Hotel pickup and drop-off are included",
        "Recommendation": "Recommended by 95% of travelers"
    },
    {
        "Number": 44,
        "Name": "Full Package Agafay Desert, Quad Bike, Camel Ride and Dinner show",
        "Price": "from $50",
        "Category": "Bus Tours",
        "Description": "On an action-packed day trip from Marrakesh, enjoy camel riding and quad biking in the Agafay desert. Enjoy views of the desert and Berber hospitality with a traditional meal. Take advantage of the hotel pickup service and head to the base camp for a meeting with your entire crew. Your tour's itinerary will be explained to you by your crew leader. Then, meet your guide and don a nomadic outfit before embarking on a scenic camel ride across the desert. Ride your camel across the desert. Then, hop on a quad bike and find a vantage point to take in the Agafay Desert's unique beauty at sunset. Relax and take in the scenery, as well as the genuine Moroccan hospitality. Finish your day by sitting under a Berber tent and gazing at the stars. as a delicious traditional meal is served.",
        "Recommendation": "Recommended by 99% of travelers"
    },
    {
        "Number": 45,
        "Name": "Hot Air Balloon Rides in Marrakesh: Sunrise, Desert, Atlas ...",
        "Price": "from $196",
        "Category": "Adventure Tours",
        "Description": "Moroccan sky ballooning | the first choice for hot air balloon rides in Marrakesh.\n\n⭐ “A must-do experience in Marrakesh” | as acclaimed by our passengers. ⭐\n\n✅ Roundtrip transportation.\n\n✅ At our base: you will be greeted by our staff with warm coffee, tea, and refreshments.\n\n✅ Show balloon preparation and inflation​\n\n✅ safety briefing from our experienced pilot.\n\nThe highlight of your experience begins as you gently lift off, soaring over the high Atlas mountains and Marrakesh’s serene desert landscapes, while watching the breathtaking sunrise.\n\n✅ Upon landing, enjoy a Berber breakfast in a traditional nomad kasbah\n\n✅ as a memento, receive a personalized flight certificate with your name in Arabic, a unique souvenir to share with loved ones✨\n\n▶ Capture these moments forever with an optional professional photography session.\n\nBook now and join us for an amazing hot air balloon ride in Marrakesh | Experience why our guests that this is the best Marrakesh Tours",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 46,
        "Name": "Small-Group Full-Day Meknes, Volubilis and Moulay Idriss Zerhoun Tour from Fez",
        "Price": "from $30",
        "Category": "Historical Tours",
        "Description": "on This Day trip you will visit Tree Different Towns,the Roman ruins of Volubilis, the Holly city of Moulay idriss and the Imperial City of Meknes, in a comfortable air conditioned car and a professional driver who speaks English.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 47,
        "Name": "Desert Agafay, Atlas Mountains and Camel Ride Day Trip From Marrakech",
        "Price": "from $13",
        "Category": "Adventure Tours",
        "Description": "Desert Agafay and Atlas Mountains day trip from Marrakech, This is the highlights of Marrakech. On this day tour to Desert Agafay & Atlas Mountains you will see the most amazing and beautiful places: Atlas Mountains, Tachdirt Valley, Ckik Valley, Amizmiz Valley, walk to Aroumd Village and visit many Berber Villages on, have tea with a berber family and learen about they life, walk up to the waterfalls and see a wonderful views of Mount Toubka. On this tour you have a chance to ride a camels and a visit to Argan women's cooperative. \n\nThe tour start at 9:00 AM, from your Accomodation or if you are satying in the Medina we can meet you at Restourant Cafe de France in Jema El fna square. \n\nThe Tour ended back in Marrakech around 17:00 PM",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 48,
        "Name": "Chafchauen Tour from Tangier for Small Groups of a Day",
        "Price": "from $65",
        "Category": "Bus Tours",
        "Description": "Excursion to Chefchaouen from Tangier. Along the way, we will discover the Rif Mountains. We will visit the magical blue city of Chefchaouen and learn about its history and the most beautiful points with an official guide. Our tour takes place in an air-conditioned minivan and WiFi, and we offer free water bottles to our customers. The driver is multilingual and speaks several languages, including Spanish, English and French. After finishing the tour with the guide, you will have free time to stroll through Chefchaouen, the blue city.\n\nEnjoy an unforgettable day! ☀️ #Chefchaouen #Excursion #Morocco #Travel #Wanderlust.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 49,
        "Name": "Day trip to Essaouira the portuguese town from Agadir or Taghazout",
        "Price": "from $39",
        "Category": "4WD Tours",
        "Description": "The Medina of Essaouira, formerly named Mogador (name originating from the Phoenician word Migdol meaning a « small fortress »), is an outstanding example of a fortified town of the mid-eighteenth century, surrounded by a wall influenced by the Vauban model. Constructed according to the principles of contemporary European military architecture, in a North African context, in perfect harmony with the precepts of Arabo-Muslim architecture and town-planning, it has played a major role over the centuries as an international trading seaport, linking Morocco and sub-Saharan Africa with Europe and the rest of the world. The town is also an example of a multicultural centre as proven by the coexistence, since its foundation, of diverse ethnic groups, such as the Amazighs, Arabs, Africans, and Europeans as well as multiconfessional (Muslim, Christian and Jewish). Indissociable from the Medina, the Mogador archipelago comprises a large number of cultural and natural sites .",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 50,
        "Name": "Private Marrakech excursion, camel ride or quad from Casablanca",
        "Price": "from $150",
        "Category": "Historical Tours",
        "Description": "This tour is unique because it offers travelers a complete experience of discovering the city of Marrakech, exploring its different districts, ranging from the historic old town to the modern city of Gueliz. Travelers will have the opportunity to discover the main tourist sites, such as the Koutoubia Mosque, the Bab Agnaou, the Souk Semmarin and the historic district of Derb Fhal Zefriti, as well as the main arteries of Gueliz. They will also be able to discover the culture and history of the city, by visiting traditional houses, hammams and workshops of local artisans, and by tasting local culinary specialties. It is an ideal way to discover all the facets of Marrakech in a single circuit.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 51,
        "Name": "Private Full Day Tour to Casablanca and Rabat",
        "Price": "from $131",
        "Category": "Full-day Tours",
        "Description": "This tour is unique because of the variety of sights and experiences it offers in a limited time. You will have the opportunity to visit the famous Hassan II Mosque in Casablanca, an emblematic place that deserves an hour of your time. You can also explore the old medina of Casablanca, make a stop at the famous Rick's Cafe and enjoy the beauty of the Corniche, all without stopping. Next, you will travel to Rabat, where you can visit the Royal Palace, explore the fascinating Chellah, discover the Hassan Tower and stroll through the charming Kasbah des Oudaias. In summary, this tour will allow you to discover historical, cultural and architectural sites, thus offering a unique experience.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 52,
        "Name": "Marrakech Day Excursion from Agadir or Taghazout",
        "Price": "from $38",
        "Category": "Historical Tours",
        "Description": "Discover the highlights and unique vibes of Marrakech in group excursion. Meet you licensed guide at 7.15 and start your 3h journey in a climate-controlled minibus or bus travelling through the Anti - Atlas Mountains. Discover lesser-known places and secrets of the incredible history of the Red City. The overview contain personalized introduction to city’s history, culture, lively description of the moroccan life style, local markets and costumes of native people. Visit most magnificent places in the city: Koutoubia Mosque, Jardin Maorelle, Bahia Palace, Marrakech Medina, Jemaa el Fna square and much more.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 53,
        "Name": "Ourika Valley, Atlas Mountain and Waterfalls Tour from Marrakech",
        "Price": "from $10",
        "Category": "4WD Tours",
        "Description": "Discover Ourika Valley on an epic journey only 60km from Marrakech. Witness Berber Villages, Argan Oil co­operatives, waterfalls, lush nature, scenic hikes, and stunning views all in one day.\n\nBe amazed by the Majestic Atlas Mountains and charming Berber Villages. Enjoy a scenic drive through breathtaking landscapes en route to Ourika Valley. Discover captivating waterfalls cascading down rugged cliffs in Ourika Valley. Savor Moroccan flavors with a delectable lunch in Ourika Valley. Visit female co­operatives and witness the production of precious Argan Oil.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 54,
        "Name": "Erg Chegaga desert in Two days one night from Zagora",
        "Price": "from $163",
        "Category": "Adventure Tours",
        "Description": "- Feel the charm of the desert.\n- Enjoy Wild life \n- See camels herds\n- See a sky full of stars \n- Sleep in a Nomad tent \n- Dress like an Arab\n- sandboarding\n- Camel ride\n- Sand dunes\n- Berber Camp\n- Erg chigaga Dunes",
        "Recommendation": "Recommended by 98% of travelers"
    },
    {
        "Number": 55,
        "Name": "Atlas Mountains and Three Valleys & Waterfalls - Villages Marrakech Day Trip",
        "Price": "from $16",
        "Category": "Adventure Tours",
        "Description": "Head out from Marrakech in the morning on an excursion that takes you to 3 different valleys and the High Atlas Mountains. Travel to Berber villages, stopping for lunch with a local family, hike to waterfalls and take in stunning mountain landscapes.\n\n- Pickup from your accommodation in Marrakech at 900 am\n- Camel ride in the Desert and a visit to Argan women's cooperative.\n- 2 hours guided walk at Berber villages in the ghit Atlas Mountains\n - Have tea with a berber family and learen about they life\n- Visite the Atlas Imlil Waterfalls\n- Visite 3 Valleys: Imlil Valley, Asni Valley, Amizmiz Valley\n\nThe tour start at 9:00am\nThe Tour ended back in Marrakech around 17:00 PM \n\nThe tour cost included: Transport, Guide, Camel ride, Beakfest, Tea with berber familly.\n\nNot included: (optional) 6 Euros for Traditional Berber meal: Salad, Tajine, Fruits, Water...",
        "Recommendation": "Recommended by 97% of travelers"
    },
    {
        "Number": 56,
        "Name": "Marrakech: Ouzoud Waterfalls Guided Day Trip with Boat Ride",
        "Price": "from $20",
        "Category": "Full-day Tours",
        "Description": "Embark on an unforgettable day trip from Marrakech to the magnificent Ouzoud Waterfalls, a natural wonder nestled in the Atlas Mountains. Join us on this guided tour and immerse yourself in the breathtaking beauty of one of Morocco's most spectacular sights.\nAlong the way, you'll encounter charming Barbary macaque monkeys, the native inhabitants of the area. Marvel at their playful antics and enjoy the opportunity to observe them in their natural habitat.\nIndulge in a delicious traditional lunch at one of the local restaurants overlooking the falls, savoring Moroccan flavors and specialties. \nAfter lunch, you'll have some free time to explore the area at your own pace. \nAs the day draws to a close, bid farewell to the Ouzoud Waterfalls and make your way back to Marrakech, filled with memories of an extraordinary adventure.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 57,
        "Name": "Private Full Day Sightseeing Marrakech Tour by Car",
        "Price": "from $142",
        "Category": "4WD Tours",
        "Description": "Explore the bustling medina of Marrakesh on a private sightseeing tour. Visit the city's main landmarks such as the 11th-century Koutoubia Mosque, Bahia Palace, Saadian Tombs, Majorelle Gardens, and the famous Jemaa El Fna Square. Learn about the history and culture of Marrakesh and Morocco while exploring the city with your guide and enjoying the vibrant atmosphere. Enjoy a personal experience with your companion and guide, on board a comfortable and luxurious car. We also ask all our clients during this tour not to hesitate to ask all their questions, whether cultural, political, social, or any question related to the Kingdom of Morocco. Our staff (guide or companion or drivers ) is ready to answer all your questions. Our vehicles are new and modern. Our drivers are flexible with customers. During the tour, They have full knowledge of the city.",
        "Recommendation": "Recommended by 100% of travelers"
    },
    {
        "Number": 58,
        "Name": "Private Rabat Guided Day Excursion from Casablanca",
        "Price": "from $93",
        "Category": "Food & Drink",
        "Description": "Discover the magic of Rabat on our Guided tour from Casablanca, Feel the royal vibes at the majestic Royal Palace and wander through the Bab Chellah. An ancient site transformed into medieval necropolis. \n\nEnjoy a relaxed walk in the Andalusian Garden , a peaceful spot shaped during the French protectorate, blending Islamic and Spanish influences. Dive into Rabat’s history within the Ancient Walls of the Medina, a UNESCO Site displaying centuries-old architecture. And more sites to discover..\n\nTo make your trip even more enjoyable, our knowledgeable guide will lead the way. Ensuring you don’t miss any historical gems. Our vehicles come equipped with WiFi and phone chargers for your convenience.",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 59,
        "Name": "Vip Full Day Private Tangier Tour From Malaga All Inclusive",
        "Price": "from $654",
        "Category": "Historical Tours",
        "Description": "Changing a continent could be a good idea for one day.\n\nTangier known for its international status for a long time welcomes travelers from many countries and is a gateway to Africa that brings together many civilizations and ancient societies. Famous for minarets, Moorish architecture and busty lifestyle it reveals the beauty of Mediterranean and Atlantic nature \n\nExplore spectacular panoramic views over Tangier's old and new city. You will be on the Mediterranean and Atlantic sides in one day, visiting predicates park, cap spartel, Hercules caves, seeing the meeting point of the Mediterranean Sea and the Atlantic Ocean and great lovely camels on the Achakar beach. Finally you will start with a walking part in Tangier Medina to see Kasbah and a museum, Berber markets, a food market, the Grand Rocco, American Legation, and more. During the tour, we stop for a Moroccan traditional lunch. A cup of refreshing mint tea or fresh orange juice will make the best of the day! Have a great tour!",
        "Recommendation": "Recommendation Not Available"
    },
    {
        "Number": 60,
        "Name": "Sahara Day Trip from Agadir",
        "Price": "from $43",
        "Category": "4WD Tours",
        "Description": "Discover the countryside and Agadir Mini Sahara by 4*4 vehicle including lunch at a Moroccan local house on a full day guided tour.\n\nfirst the wild beach tour and enjoy the amazing landscapes of the wild beach.\n\nThen continue to the Sousse Valley to explore the local Berber way of life and meet the locals.\n\nThen a historical visit of the old medina of Tiznit known as the silver city.\n\nAfter Tiznit, we will return to Rasmouka where a delicious tajine and homemade couscous awaits us.\n\nAfter lunch a delicious Moroccan mint tea.\n\nWe will continue our visits to the Sahara for your free time to enjoy the silence of the region and take some photos or take a camel ride (optional).\n\non the return to agadir, we will make a last stop at the Yussuf Ibnu Tachafin water reservoir to admire the panoramic view of the anti atlas and sahara.\n\nat the end by dropping you off at the hotel.",
        "Recommendation": "Recommended by 100% of travelers"
    }
]